In [17]:
import pandas as pd
cars={"Brand":['Audi','Toyota','Porse','Dodge'],"Price":[1000,2000,3000,1500]}
df=pd.DataFrame(cars)
df

    Brand  Price
0    Audi   1000
1  Toyota   2000
2   Porse   3000
3   Dodge   1500

In [29]:
type(df)

pandas.core.frame.DataFrame

In [25]:
type(cars)

dict

In [39]:
df.shape

(4, 2)

In [41]:
x=[1,4,8,12]
y=[1,3,6,9]
pd.DataFrame(y,columns=["Tamim"],index=['a','b','c','d'])

   Tamim
a      1
b      3
c      6
d      9

In [51]:
a=[['Madrid','Barcelona','Atlentico'],[15,5,1]]
df=pd.DataFrame(a,columns=['USL','USL1','USL2'])
df

      USL       USL1       USL2
0  Madrid  Barcelona  Atlentico
1      15          5          1

In [35]:
d={"a":[1,2,3,4,5], "b":[2,3,7,8,9]}
y=pd.DataFrame(d,columns=['b'])
print(y)

   b
0  2
1  3
2  7
3  8
4  9

In [79]:
a=[1,2,3,4]
b=[2,4,6,8]
dict1={'list1':a,'list':b}

df=pd.DataFrame(dict1)
df

   list1  list
0      1     2
1      2     4
2      3     6
3      4     8

In [67]:
dfm=pd.DataFrame({"A":[1,2,3,4],"B":[2,4,6,8]})
dfm

   A  B
0  1  2
1  2  4
2  3  6
3  4  8

In [81]:
dfm["C"]=dfm["A"]+dfm["B"]
dfm

   A  B   C
0  1  2   3
1  2  4   6
2  3  6   9
3  4  8  12

In [43]:
dfm["D"]=dfm["A"] >=3
print(dfm)

   A  B   C      D
0  1  2   3  False
1  2  4   6  False
2  3  6   9   True
3  4  8  12   True

In [45]:
m=pd.DataFrame({"A":[1,2,3,4],"B":[2,4,6,8]})
m.insert(0,"NeW",[2,3,5,7])

print(m)
print()

x=m.pop("A")
print(x)
print(m)

   NeW  A  B
0    2  1  2
1    3  2  4
2    5  3  6
3    7  4  8

0    1
1    2
2    3
3    4
Name: A, dtype: int64
   NeW  B
0    2  2
1    3  4
2    5  6
3    7  8

In [83]:
d={"A":[10,20,30,40],"B":[11,22,33,44],"C":[12,24,34,44]}
x=pd.DataFrame(d)
print(x)
x.to_csv("First_CSV",index=False)

    A   B   C
0  10  11  12
1  20  22  24
2  30  33  34
3  40  44  44

In [85]:
import pandas as pd
x=[1,2,3,6,8]
y=pd.Series(x)
z=pd.Series(x, index=['a','b','c','d','e'],dtype="float",name="python")
print(y)
print(z)

0    1
1    2
2    3
3    6
4    8
dtype: int64
a    1.0
b    2.0
c    3.0
d    6.0
e    8.0
Name: python, dtype: float64

In [87]:
s1=pd.Series(10,index=[1,2,3,4])
s2=pd.Series(12,index=[1,2])
print(s1+s2)

1    22.0
2    22.0
3     NaN
4     NaN
dtype: float64

In [95]:
df=pd.read_csv("blood.csv")
df

     Recency  Frequency  Monetary  Time  Class
0          2         50     12500    98      1
1          0         13      3250    28      1
2          1         16      4000    35      1
3          2         20      5000    45      1
4          1         24      6000    77      0
..       ...        ...       ...   ...    ...
743       23          2       500    38      0
744       21          2       500    52      0
745       23          3       750    62      0
746       39          1       250    39      0
747       72          1       250    72      0

[748 rows x 5 columns]

In [97]:
df.shape    #rows*columns

(748, 5)

In [99]:
df.head(2)

   Recency  Frequency  Monetary  Time  Class
0        2         50     12500    98      1
1        0         13      3250    28      1

In [101]:
df.tail(1)

     Recency  Frequency  Monetary  Time  Class
747       72          1       250    72      0

In [103]:
df.columns    #name of the columns in the dataset

Index(['Recency', 'Frequency', 'Monetary', 'Time', 'Class'], dtype='object')

In [165]:
df.Frequency  #the values of Frequency column

0      50
1      13
2      16
3      20
4      24
       ..
743     2
744     2
745     3
746     1
747     1
Name: Frequency, Length: 748, dtype: int64

In [107]:
df.info

<bound method DataFrame.info of      Recency  Frequency  Monetary  Time  Class
0          2         50     12500    98      1
1          0         13      3250    28      1
2          1         16      4000    35      1
3          2         20      5000    45      1
4          1         24      6000    77      0
..       ...        ...       ...   ...    ...
743       23          2       500    38      0
744       21          2       500    52      0
745       23          3       750    62      0
746       39          1       250    39      0
747       72          1       250    72      0

[748 rows x 5 columns]>

In [109]:
df=pd.read_csv("blood.csv")
type(df)

pandas.core.frame.DataFrame

In [111]:
df["Frequency"].max()

50

In [115]:
df["Recency"].min()

0

In [117]:
df["Monetary"].mean()

1378.6764705882354

In [119]:
df["Monetary"].std()

1459.826780772503

In [121]:
df.describe()   #summary

          Recency   Frequency      Monetary        Time       Class
count  748.000000  748.000000    748.000000  748.000000  748.000000
mean     9.506684    5.514706   1378.676471   34.282086    0.237968
std      8.095396    5.839307   1459.826781   24.376714    0.426124
min      0.000000    1.000000    250.000000    2.000000    0.000000
25%      2.750000    2.000000    500.000000   16.000000    0.000000
50%      7.000000    4.000000   1000.000000   28.000000    0.000000
75%     14.000000    7.000000   1750.000000   50.000000    0.000000
max     74.000000   50.000000  12500.000000   98.000000    1.000000

In [53]:
df[df["Frequency"]>40]   #only showing above 40 values

     Recency  Frequency  Monetary  Time  Class
0          2         50     12500    98      1
9          5         46     11500    98      1
500        2         43     10750    86      1
503        2         44     11000    98      0
505        2         41     10250    98      1

In [123]:
df["Frequency"][df["Monetary"]>30]

0      50
1      13
2      16
3      20
4      24
       ..
743     2
744     2
745     3
746     1
747     1
Name: Frequency, Length: 748, dtype: int64

In [125]:
df.loc[0]    #showing the index 0's information, loc takes the index value and gives the result for that index

Recency          2
Frequency       50
Monetary     12500
Time            98
Class            1
Name: 0, dtype: int64

In [127]:
df.iloc[0]     #iloc takes the position of an index and gives the row.

Recency          2
Frequency       50
Monetary     12500
Time            98
Class            1
Name: 0, dtype: int64

In [129]:
df.index

RangeIndex(start=0, stop=748, step=1)

In [131]:
df[4:7]    #initialization:end  index

   Recency  Frequency  Monetary  Time  Class
4        1         24      6000    77      0
5        4          4      1000     4      0
6        2          7      1750    14      1

In [133]:
df.to_numpy()  #covert as a numpy

array([[    2,    50, 12500,    98,     1],
       [    0,    13,  3250,    28,     1],
       [    1,    16,  4000,    35,     1],
       ...,
       [   23,     3,   750,    62,     0],
       [   39,     1,   250,    39,     0],
       [   72,     1,   250,    72,     0]], dtype=int64)

In [135]:
df.set_index("Recency")    #recency turns into index

         Frequency  Monetary  Time  Class
Recency
2               50     12500    98      1
0               13      3250    28      1
1               16      4000    35      1
2               20      5000    45      1
1               24      6000    77      0
...            ...       ...   ...    ...
23               2       500    38      0
21               2       500    52      0
23               3       750    62      0
39               1       250    39      0
72               1       250    72      0

[748 rows x 4 columns]

In [137]:
cs=pd.read_csv("data.csv",index_col="Maxpulse")   #Maxpulse turns into index
print(cs)

          Duration  Pulse  Calories
Maxpulse
130             60    110     409.1
145             60    117     479.0
135             60    103     340.0
175             45    109     282.4
148             45    117     406.0
...            ...    ...       ...
140             60    105     290.8
145             60    110     300.0
145             60    115     310.2
150             75    120     320.4
150             75    125     330.4

[169 rows x 3 columns]

In [139]:
import pandas as pd
cs=pd.read_csv("data.csv",nrows=2)        #only rows
print(cs)

   Duration  Pulse  Maxpulse  Calories
0        60    110       130     409.1
1        60    117       145     479.0

In [141]:
import pandas as pd
cs=pd.read_csv("data.csv",skiprows=[0,1,2,3,4,5])   #rows skip
print(cs)

     60  102  127  300.0
0    60  110  136  374.0
1    45  104  134  253.3
2    30  109  133  195.1
3    60   98  124  269.0
4    60  103  147  329.3
..   ..  ...  ...    ...
158  60  105  140  290.8
159  60  110  145  300.0
160  60  115  145  310.2
161  75  120  150  320.4
162  75  125  150  330.4

[163 rows x 4 columns]

In [143]:
cs=pd.read_csv("data.csv",usecols=["Pulse"])   #only columns
cs=pd.read_csv("data.csv",usecols=[0,3])       #index number add kore
print(cs)

     Duration  Calories
0          60     409.1
1          60     479.0
2          60     340.0
3          45     282.4
4          45     406.0
..        ...       ...
164        60     290.8
165        60     300.0
166        60     310.2
167        75     320.4
168        75     330.4

[169 rows x 2 columns]

In [27]:
cs=pd.read_csv("data.csv",header=2)   #index2 will be the heading
print(cs)

     60  117  145  479.0
0    60  103  135  340.0
1    45  109  175  282.4
2    45  117  148  406.0
3    60  102  127  300.0
4    60  110  136  374.0
..   ..  ...  ...    ...
162  60  105  140  290.8
163  60  110  145  300.0
164  60  115  145  310.2
165  75  120  150  320.4
166  75  125  150  330.4

[167 rows x 4 columns]

In [29]:
cs=pd.read_csv("data.csv",names=["sami","tamim"])   #sami & tamim turns into head
print(cs)

                    sami     tamim
Duration Pulse  Maxpulse  Calories
60       110         130     409.1
         117         145     479.0
         103         135     340.0
45       109         175     282.4
...                  ...       ...
60       105         140     290.8
         110         145     300.0
         115         145     310.2
75       120         150     320.4
         125         150     330.4

[170 rows x 2 columns]

In [31]:
cs=pd.read_csv("data.csv",dtype={"Pulse":"float"})   #pulse will show the float values
print(cs)

     Duration  Pulse  Maxpulse  Calories
0          60  110.0       130     409.1
1          60  117.0       145     479.0
2          60  103.0       135     340.0
3          45  109.0       175     282.4
4          45  117.0       148     406.0
..        ...    ...       ...       ...
164        60  105.0       140     290.8
165        60  110.0       145     300.0
166        60  115.0       145     310.2
167        75  120.0       150     320.4
168        75  125.0       150     330.4

[169 rows x 4 columns]

In [159]:
df=pd.read_csv("blood.csv")
df

     Recency  Frequency  Monetary  Time  Class
0          2         50     12500    98      1
1          0         13      3250    28      1
2          1         16      4000    35      1
3          2         20      5000    45      1
4          1         24      6000    77      0
..       ...        ...       ...   ...    ...
743       23          2       500    38      0
744       21          2       500    52      0
745       23          3       750    62      0
746       39          1       250    39      0
747       72          1       250    72      0

[748 rows x 5 columns]

In [161]:
df.drop(columns=["Recency","Frequency","Class"])

     Monetary  Time
0       12500    98
1        3250    28
2        4000    35
3        5000    45
4        6000    77
..        ...   ...
743       500    38
744       500    52
745       750    62
746       250    39
747       250    72

[748 rows x 2 columns]